
def tests():
    count_tests = input('Введите количество повторных запусков теста: ') #Ввод числа тестов
    timeout = input('Введите значение таймаута: ') #Ввод таймаута

    if int(timeout) < 0: #Отброс ошибки некорректного таймаута
        raise ValueError("Значение таймаута не может быть меньше или равно нуля!")
    elif not  (0 < int(count_tests) <= 5): #Отброс ошибки некорректного числа тестов
        raise ValueError("Количество повторных запусков не может быть меньше или равно нуля и больше 5!")

try:
    tests()
except ValueError as e:
    print(f'Ошибка: {e}')

